buzzwang1/pcb/source/main/NRF52840/ble/Ls/main.cpp


#include <stdint.h>
#include <string.h>
#include "main.h"
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_twi.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_systick.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_timer.h"
#include "nrf_delay.h"

//#include "nrf_uarte.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "i2c_devices.h"

// nRF52840
// ARM®-based Cortex®-M4 32b MCU, (64 MHz max)
// Rom 1024KB
// Ram 256KB

// pca10056 = > nRF52840 eval board
// pca10059 = > nRF52840 usb dongle


// P0.13 Ext_Power_Pin
//
// P1.11 FEN3
// P1.13 FEN2
// P1.15 FEN1
//
// P0.31 AIN7 SENA
// P0.29 AIN5 SENB
//
// P0.06 SCL
// P0.08 SDA
//
// P0.10 TX
// P0.09 Rx

//I2C Adresses
// TMP102:             0x90
// L3GD20:  Gyro:      0xD4
// LSM303D: Acc:       0x32
// LSM303D: Mag:       0x3C


// P0.04 AIN2 BVolt
// 2M - 806k => 0.713 =>
//              3300 / 0.713 => 4630mV
//                    4630mV = > 3300 mV
//                    4200mV = > 3000 mV
//                    3500mV = > 2495 mV
//                    3000mV = > 2140 mV




volatile uint8_t ADC_Finished = 0;

volatile static nrf_saadc_value_t     m_Adc_Bat;

volatile static nrf_saadc_value_t     m_ADC_SEN[2 * 3 * 8]; // 2 ADC channels SEN A/B; 3 measurements per channel, 8 Mux channels
volatile static i16                   m_ADC_SEN2[2][8]; // 2 ADC channels SEN A/B; 3 measurements per channel, 8 Mux channels

u16      mau16SensDataAll[64];


void saadc_callback(nrf_drv_saadc_evt_t const* p_event)
{
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
  {
    ADC_Finished = 1;
  }
}


void saadc_init(void)
{
  // P0.31 AIN7 SENA
  // P0.29 AIN5 SENB
  // P0.04 AIN2 BVolt


  ret_code_t err_code;

  nrf_saadc_channel_config_t lChannelCfg;

  lChannelCfg.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
  lChannelCfg.resistor_n = NRF_SAADC_RESISTOR_DISABLED;
  lChannelCfg.gain       = NRF_SAADC_GAIN1;
  lChannelCfg.reference  = NRF_SAADC_REFERENCE_INTERNAL;
  lChannelCfg.acq_time   = NRF_SAADC_ACQTIME_5US;
  lChannelCfg.mode       = NRF_SAADC_MODE_SINGLE_ENDED;
  lChannelCfg.burst      = NRF_SAADC_BURST_DISABLED;
  lChannelCfg.pin_n      = NRF_SAADC_INPUT_DISABLED;

  err_code = nrf_drv_saadc_init(NULL, saadc_callback);
  APP_ERROR_CHECK(err_code);

  lChannelCfg.pin_p = (nrf_saadc_input_t)(NRF_SAADC_INPUT_AIN7);
  err_code = nrf_drv_saadc_channel_init(0, &lChannelCfg);
  APP_ERROR_CHECK(err_code);

  lChannelCfg.pin_p = (nrf_saadc_input_t)(NRF_SAADC_INPUT_AIN5);
  err_code = nrf_drv_saadc_channel_init(1, &lChannelCfg);
  APP_ERROR_CHECK(err_code);

  lChannelCfg.pin_p = (nrf_saadc_input_t)(NRF_SAADC_INPUT_AIN2);
  err_code = nrf_drv_saadc_channel_init(2, &lChannelCfg);
  APP_ERROR_CHECK(err_code);
}


/* Indicates if operation on TWI has ended. */
static volatile bool m_xfer_done = false;

/* TWI instance. */
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);

/* Buffer for samples read from temperature sensor. */
static u8  m_Tmp102_Val;

typedef struct
{
  i16 x;
  i16 y;
  i16 z;
}tstPos3d;


tstPos3d mstLsm303AccVal;
tstPos3d mstL3GD20GyroVal;

void vI2cTest(void)
{

  ret_code_t err_code;
  u8 reg[1] = { 0 };

  for (u8 lu8Idx = 0; lu8Idx < 128; lu8Idx++)
  {
    m_xfer_done = false;
    err_code = nrf_drv_twi_tx(&m_twi, lu8Idx, reg, 1, false);
    if (err_code)
    {
      __asm("nop");
    }
    while (m_xfer_done == false);
  }
}



void LSM303DLHC_ACC_set_mode(void)
{
  u8 lui8Reg[6];
  lui8Reg[0] = (LSM303DLHC_ACC_ODR_50_HZ | LSM303DLHC_ACC_NORMAL_MODE |
                LSM303DLHC_ACC_X_ENABLE  | LSM303DLHC_ACC_Y_ENABLE | LSM303DLHC_ACC_Z_ENABLE);
  lui8Reg[1] = LSM303DLHC_ACC_HPM_NORMAL_MODE | LSM303DLHC_ACC_HPFCF_32;
  lui8Reg[2] = 0;// No Ints
  lui8Reg[3] = LSM303DLHC_ACC_BlockUpdate_Continous | LSM303DLHC_ACC_FULLSCALE_4G;
  lui8Reg[4] = 0;
  lui8Reg[5] = 0;

  ret_code_t err_code;
  u8 reg[2] = { LSM303DLHC_ACC_CTRL_REG1_A, lui8Reg[0] };

  for (u8 lu8Idx = 0; lu8Idx < 6; lu8Idx++)
  {
    reg[1] = lui8Reg[lu8Idx];

    m_xfer_done = false;
    err_code = nrf_drv_twi_tx(&m_twi, LSM303DLHC_ADDRESS_DEFAULT, reg, 2, false);
    if (err_code)
    {
      __asm("nop");
    }
    while (m_xfer_done == false);
    reg[0]++;
  }
}



static void LSM303DLHC_Read_Acc()
{
  // Write Adress
  ret_code_t err_code;
  u8 reg = { 0x80 | LSM303DLHC_ACC_OUT_X_L_A };
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, LSM303DLHC_ADDRESS_DEFAULT, &reg, 1, false);
  if (err_code)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);


  m_xfer_done = false;
  err_code = nrf_drv_twi_rx(&m_twi, LSM303DLHC_ADDRESS_DEFAULT, (u8*)&mstLsm303AccVal, 6);
  if (err_code != 0)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);
}


void L3GD20_ACC_set_mode(void)
{
  ret_code_t err_code;
  u8 reg[2];

  /* Configure MEMS: data rate, power mode, full scale and axes */
  u8 ctrl1 = (u8)(L3GD20_MODE_ACTIVE | L3GD20_OUTPUT_DATARATE_2 |
                  L3GD20_AXES_ENABLE | L3GD20_BANDWIDTH_4);
  reg[0] = L3GD20_CTRL_REG1_ADDR;
  reg[1] = ctrl1;
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, L3GD20_ADDRESS_DEFAULT, reg, 2, false);
  if (err_code)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);

  u8 ctrl4 = (u8)(L3GD20_BlockDataUpdate_Continous | L3GD20_BLE_LSB |
                  L3GD20_FULLSCALE_500);
  reg[0] = L3GD20_CTRL_REG4_ADDR;
  reg[1] = ctrl4;
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, L3GD20_ADDRESS_DEFAULT, reg, 2, false);
  if (err_code)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);


  u8 ctrl5 = (u8)(L3GD20_HIGHPASSFILTER_ENABLE);
  reg[0] = L3GD20_CTRL_REG5_ADDR;
  reg[1] = ctrl5;
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, L3GD20_ADDRESS_DEFAULT, reg, 2, false);
  if (err_code)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);
}


static void L3GD20_Read_Gyro()
{
  // Write Adress
  ret_code_t err_code;
  /* In order to read multiple bytes, it is necessary to assert the
     most significant bit of the sub-address field. In other words,
     SUB(7) must be equal to 1 while SUB(6-0) represents the address
     of the first register to be read. */
  u8 reg = { 0x80 | L3GD20_OUT_X_L_ADDR };
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, L3GD20_ADDRESS_DEFAULT, &reg, 1, false);
  if (err_code)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);


  m_xfer_done = false;
  err_code = nrf_drv_twi_rx(&m_twi, L3GD20_ADDRESS_DEFAULT, (u8*)&mstL3GD20GyroVal, 6);
  if (err_code != 0)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);
}


void TMP102_set_mode(void)
{
  ret_code_t err_code;

  /* Writing to TMP102_REG_CONF "0" set temperature sensor in NORMAL mode. */
  uint8_t reg[3] = { TMP102_REG_CONF, NORMAL_MODE };
  // err_code = nrf_drv_twi_tx(&m_twi, TMP102_ADDR, reg, sizeof(reg), false);
  // APP_ERROR_CHECK(err_code);
  // while (m_xfer_done == false);

  /* Writing to pointer byte. */
  reg[0] = TMP102_REG_TEMP;
  m_xfer_done = false;
  err_code = nrf_drv_twi_tx(&m_twi, TMP102_ADDR, reg, 1, false);
  if (err_code != 0)
  {
    __asm("nop");
  }
  while (m_xfer_done == false);
}


/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
  switch (p_event->type)
  {
    case NRF_DRV_TWI_EVT_DONE:
      m_xfer_done = true;
      break;
    case NRF_DRV_TWI_EVT_ADDRESS_NACK:
      m_xfer_done = true;
      break;
    case NRF_DRV_TWI_EVT_DATA_NACK:
      m_xfer_done = true;
      break;
    default:
      break;
  }
}


