buzzwang1/pcb/source/main/NRF52840/ble/Ls/main.cpp
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


static void vAnaMuxWait(u16 lu16Delay)
{
  for (u16 lu16t = 0; lu16t < lu16Delay; lu16t++)
  {
    __asm("nop");
  }
}

static void vAnaMuxAdr(u32 lu32Adr)
{
  lu32Adr &= 7;
  volatile u32 lu32Port = NRF_P1->OUTSET;

  lu32Port &= ~((1 << 15) | (1 << 13) | (1 << 11));

  if (lu32Adr & 1) lu32Port |= (1 << 15);
  if (lu32Adr & 2) lu32Port |= (1 << 13);
  if (lu32Adr & 4) lu32Port |= (1 << 11);

  NRF_P1->OUT = lu32Port;
}


static void vInitAnaMux()
{
   //P1.15 FEN1
   //P1.13 FEN2
   //P1.11 FEN3

  nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 15));
  nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 13));
  nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 11));

  vAnaMuxAdr(0);
}

static void vExt3v3_On()
{
  nrf_gpio_pin_write(NRF_GPIO_PIN_MAP(0, 13), 1);
}

static void vExt3v3_Off()
{
  nrf_gpio_pin_write(NRF_GPIO_PIN_MAP(0, 13), 0);
}

static void vInitExt3v3()
{
  //P0.13 Ext_Power_Pin
  vExt3v3_Off();
  nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(0, 13));
  vExt3v3_Off();
}



/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


int16 i16Swap(i16 liVal)
{
  u8* lu8Val;
  u8  lu8Temp;

  lu8Val = (u8*)&liVal;

  lu8Temp = lu8Val[0];
  lu8Val[0] = lu8Val[1];
  lu8Val[1] = lu8Temp;

  return liVal;
}

const nrf_drv_timer_t TIMER_CNT = NRF_DRV_TIMER_INSTANCE(1);
u32 mu32Counter;

void Counter_event_handler(nrf_timer_event_t event_type, void* p_context)
{
  switch (event_type)
  {
  case NRF_TIMER_EVENT_COMPARE0:
    mu32Counter++;
    break;

  default:
    break;
  }
}

void Counter_init(void)
{
  uint32_t time_ms = 1; //Time(in miliseconds) between consecutive compare events.
  uint32_t time_ticks;
  uint32_t err_code = NRF_SUCCESS;

  //Configure TIMER_LED for generating simple light effect - leds on board will invert his state one after the other.
  nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
  err_code = nrf_drv_timer_init(&TIMER_CNT, &timer_cfg, Counter_event_handler);
  APP_ERROR_CHECK(err_code);

  time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_CNT, time_ms);

  nrf_drv_timer_extended_compare(&TIMER_CNT, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

  nrf_drv_timer_enable(&TIMER_CNT);
}



/**@brief Application main function.
 */
int main(void)
{
    u8 lu8SenIdx = 0;
    u16 lu16SendCnt = 0;
    bool erase_bonds;

    // Initialize.
    ////uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    vInitExt3v3();
    vExt3v3_On();  //Einschalten für I2c Init
    vInitAnaMux();
    twi_init();
    saadc_init();
    //vI2cTest();
    TMP102_set_mode();
    LSM303DLHC_ACC_set_mode();
    L3GD20_ACC_set_mode();
    nrf_drv_systick_init();
    Counter_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
      //idle_state_handle();

      vExt3v3_On();

      vAnaMuxAdr(lu8SenIdx);
      vAnaMuxWait(250); // 250 entspr. 25us

      //nrf_drv_saadc_buffer_convert((nrf_saadc_value_t*)m_ADC_SEN, 6);
      ADC_Finished = 0;

      nrfx_saadc_sample_convert(0, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 0]);
      nrfx_saadc_sample_convert(0, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 2]);
      nrfx_saadc_sample_convert(0, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 4]);

      nrfx_saadc_sample_convert(1, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 1]);
      nrfx_saadc_sample_convert(1, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 3]);
      nrfx_saadc_sample_convert(1, (nrf_saadc_value_t*) &m_ADC_SEN[lu8SenIdx * 6 + 5]);

      switch (lu8SenIdx)
      {
        case 0:
          m_ADC_SEN2[0][2] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][2] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          nrfx_saadc_sample_convert(2, (nrf_saadc_value_t*)&m_Adc_Bat);
          break;
        case 1:
          m_ADC_SEN2[0][1] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][1] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 2:
          m_ADC_SEN2[0][0] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][0] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 3:
          m_ADC_SEN2[0][3] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][3] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 4:
          m_ADC_SEN2[0][4] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][4] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 5:
          m_ADC_SEN2[0][7] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][7] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 6:
          m_ADC_SEN2[0][5] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][5] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
        case 7:
          m_ADC_SEN2[0][6] = (m_ADC_SEN[lu8SenIdx * 6 + 0] + m_ADC_SEN[lu8SenIdx * 6 + 2] + m_ADC_SEN[lu8SenIdx * 6 + 4]) / 3;
          m_ADC_SEN2[1][6] = (m_ADC_SEN[lu8SenIdx * 6 + 1] + m_ADC_SEN[lu8SenIdx * 6 + 3] + m_ADC_SEN[lu8SenIdx * 6 + 5]) / 3;
          break;
      }

      lu8SenIdx++;

      if (lu8SenIdx > 7)
      {
        // Ohne Gyro
          // Wird ca. alle 1.5ms aufgerufen
          // und dauert 300us
        // Mit Gyro
          // Wird ca. alle 1.65ms aufgerufen
          // und dauert 560us
        lu8SenIdx = 0;
        TMP102_Read_Temp();
        LSM303DLHC_Read_Acc();
        L3GD20_Read_Gyro();

