buzzwang1/pcb/source/main/NRF52840/ble/Ls/main.cpp
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
          if (lu16SendCnt == 0)
          {
            //char lcMyText[64];
            //u16 lu16Strlen;
            //sprintf(lcMyText, "%d %d %d %d", m_ADC_SEN2[0][0], m_ADC_SEN2[0][1], m_ADC_SEN2[0][2], m_ADC_SEN2[0][3]);
            //lu16Strlen = strlen(lcMyText);
            //mau16SensDataAll
            //ble_nus_data_send(&m_nus, (u8*)mau16SensDataAll, &lu16Strlen, m_conn_handle);

            for (u8 lu8t = 0; lu8t < 8; lu8t++)
            {
              if ((m_ADC_SEN2[0][lu8t]) < 0)
              {
                __asm ("NOP");
                m_ADC_SEN2[0][lu8t] = 0;
              }
              if ((m_ADC_SEN2[0][lu8t]) > 4095)
              {
                __asm ("NOP");
                m_ADC_SEN2[0][lu8t] = 4095;
              }
              if ((m_ADC_SEN2[1][lu8t]) < 0)
              {
                __asm ("NOP");
                m_ADC_SEN2[1][lu8t] = 0;
              }
              if ((m_ADC_SEN2[1][lu8t]) > 4095)
              {
                __asm ("NOP");
                m_ADC_SEN2[1][lu8t] = 4095;
              }

              mau16SensDataAll[0 + lu8t] = i16Swap(m_ADC_SEN2[0][lu8t]);
              mau16SensDataAll[8 + lu8t] = i16Swap(m_ADC_SEN2[1][lu8t]);
            }

            // Temp
            mau16SensDataAll[16] = i16Swap(m_Tmp102_Val);

            // Acc
            mau16SensDataAll[17] = i16Swap(mstLsm303AccVal.x);
            mau16SensDataAll[18] = i16Swap(mstLsm303AccVal.y);
            mau16SensDataAll[19] = i16Swap(mstLsm303AccVal.z);

            // Gyro
            mau16SensDataAll[20] = i16Swap(mstL3GD20GyroVal.x);
            mau16SensDataAll[21] = i16Swap(mstL3GD20GyroVal.y);
            mau16SensDataAll[22] = i16Swap(mstL3GD20GyroVal.z);

            // Zeitstempel
            u8* mpu8Time = (u8*)&mau16SensDataAll[23];
            mpu8Time[0] = ((mu32Counter >> 24) & 0xFF);
            mpu8Time[1] = ((mu32Counter >> 16) & 0xFF);
            mpu8Time[2] = ((mu32Counter >>  8) & 0xFF);
            mpu8Time[3] = ((mu32Counter >>  0) & 0xFF);

            mau16SensDataAll[25] = i16Swap(m_Adc_Bat);

                            //Fuss    Temp    Acc     Gyro    Tick   Bat
            u16 lu16Strlen = 16 * 2 + 1 * 2 + 3 * 2 + 3 * 2 +   4 +  1 * 2; // 50

            ble_nus_data_send(&m_nus, (u8*)mau16SensDataAll, &lu16Strlen, m_conn_handle);

            lu16SendCnt = 54;
          }
          else
          {
            lu16SendCnt--;
          }
        }
        else
        {
          lu16SendCnt = 0;
        }
      }
    }
}


// This is called from the Startup Code, before the c++ contructors
void MainSystemInit()
{
}

